In [30]:
import pandas as pd
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [31]:
df.shape

(6, 4)

In [32]:
rows,columns = df.shape

In [33]:
rows

6

In [34]:
columns

4

In [35]:
df.head()

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain

In [36]:
df.head(2)

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny

In [37]:
df.tail()

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [38]:
df.tail(1)

        day  temperature  windspeed  event
5  01/06/17           32          2  Sunny

In [39]:
df[2:5]

        day  temperature  windspeed event
2  01/03/17           28          2  Snow
3  01/04/17           24          7  Snow
4  01/05/17           32          4  Rain

In [40]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [41]:
df.day

0    01/01/17
1    01/02/17
2    01/03/17
3    01/04/17
4    01/05/17
5    01/06/17
Name: day, dtype: object

In [42]:
type(df['event'])

pandas.core.series.Series

In [43]:
df[['event','day']]

   event       day
0   Rain  01/01/17
1  Sunny  01/02/17
2   Snow  01/03/17
3   Snow  01/04/17
4   Rain  01/05/17
5  Sunny  01/06/17

In [44]:
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    32
Name: temperature, dtype: int64

In [45]:
df['temperature'].max()

35

In [46]:
df['temperature'].min()

24

In [47]:
df['temperature'].std()

3.8858718455450894

In [48]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.500000   4.666667
std       3.885872   2.338090
min      24.000000   2.000000
25%      29.000000   2.500000
50%      32.000000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [49]:
df[df.temperature>=32]

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [50]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  01/02/17           35          7  Sunny

In [51]:
df['day'][df.temperature == df.temperature.max()]

1    01/02/17
Name: day, dtype: object

In [53]:
df[['day','temperature']][df.temperature == df.temperature.max()]

        day  temperature
1  01/02/17           35

In [54]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [55]:
df.set_index('day')

          temperature  windspeed  event
day
01/01/17           32          6   Rain
01/02/17           35          7  Sunny
01/03/17           28          2   Snow
01/04/17           24          7   Snow
01/05/17           32          4   Rain
01/06/17           32          2  Sunny

In [56]:
df

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [58]:
df.set_index('day', inplace = True)

In [59]:
df

          temperature  windspeed  event
day
01/01/17           32          6   Rain
01/02/17           35          7  Sunny
01/03/17           28          2   Snow
01/04/17           24          7   Snow
01/05/17           32          4   Rain
01/06/17           32          2  Sunny

In [60]:
df.loc['01/05/17']

temperature      32
windspeed         4
event          Rain
Name: 01/05/17, dtype: object

In [61]:
df.reset_index(inplace = True)

In [62]:
df

        day  temperature  windspeed  event
0  01/01/17           32          6   Rain
1  01/02/17           35          7  Sunny
2  01/03/17           28          2   Snow
3  01/04/17           24          7   Snow
4  01/05/17           32          4   Rain
5  01/06/17           32          2  Sunny

In [63]:
df.set_index('event', inplace =True)

In [64]:
df

            day  temperature  windspeed
event
Rain   01/01/17           32          6
Sunny  01/02/17           35          7
Snow   01/03/17           28          2
Snow   01/04/17           24          7
Rain   01/05/17           32          4
Sunny  01/06/17           32          2

In [65]:
df.loc['Snow']

            day  temperature  windspeed
event
Snow   01/03/17           28          2
Snow   01/04/17           24          7